kenyon-mitchell01/XIAO-ESP32S3-MJPEG2SD/src/EMJPEG2SD_DopamineChaser247_Version1/utilsFS.cpp
// General purpose SD card and flash storage utilities
//
// Card can be accessed using a 1 data bit or 4 data bits (if allowed by board)
// 4 data bits is potentially faster on ESP32S3 (depending on card spec) 
// but requires 3 additional pins
/* The following #defines must be declared under the relevant camera entry in camera_pins.h
   1 bit       4 bit        
   SD_MMC_CMD  SD_MMC_CMD  
   SD_MMC_CLK  SD_MMC_CLK   
   SD_MMC_D0   SD_MMC_D0    
               SD_MMC_D1     
               SD_MMC_D2    
               SD_MMC_D3    
*/
// s60sc 2021, 2022, 2025

#include "appGlobals.h"
#include <Arduino.h> // For Serial
#include <SD_MMC.h>  // For SD_MMC


// Storage settings
int sdMinCardFreeSpace = 100; // Minimum amount of card free Megabytes before sdFreeSpaceMode action is enabled
int sdFreeSpaceMode = 1; // 0 - No Check, 1 - Delete oldest dir, 2 - Upload oldest dir to FTP/HFS and then delete on SD 
bool formatIfMountFailed = true; // Auto format the file system if mount failed. Set to false to not auto format.
static int sdmmcFreq = BOARD_MAX_SDMMC_FREQ; // board specific default SD_MMC speed
static bool use1bitMode = true;
static fs::FS fp = STORAGE;

// hold sorted list of filenames/folders names in order of newest first
static std::vector<std::string> fileVec;
static auto currentDir = "/~current";
static auto previousDir = "/~previous";
static char fsType[10] = {0};

static void infoSD() {
#if (!CONFIG_IDF_TARGET_ESP32C3 && !CONFIG_IDF_TARGET_ESP32S2)
  uint8_t cardType = SD_MMC.cardType();
  if (cardType == CARD_NONE) LOG_WRN("No SD card attached");
  else {
    char typeStr[8] = "UNKNOWN";
    if (cardType == CARD_MMC) strcpy(typeStr, "MMC");
    else if (cardType == CARD_SD) strcpy(typeStr, "SDSC");
    else if (cardType == CARD_SDHC) strcpy(typeStr, "SDHC");
    LOG_INF("SD card type %s, Size: %s, using %d bit mode @ %uMHz", typeStr, fmtSize(SD_MMC.cardSize()), use1bitMode ? 1 : 4, sdmmcFreq / 1000);
  }
#endif
}

//New prepSD_MMC() from Claude 3.7, 04/17/2025
static bool prepSD_MMC() {
    bool res = false;
#if (!CONFIG_IDF_TARGET_ESP32C3 && !CONFIG_IDF_TARGET_ESP32S2)
    if (psramFound()) heap_caps_malloc_extmem_enable(MIN_RAM);
    fileVec.reserve(1000);
    if (psramFound()) heap_caps_malloc_extmem_enable(MAX_RAM);
    
    // Debug and setup preparations
    Serial.println("Preparing to initialize SD card...");
    
#if CONFIG_IDF_TARGET_ESP32S3
    #if !defined(SD_MMC_CLK)
        LOG_WRN("SD card pins not defined");
        Serial.println("SD card pins not defined - cannot initialize SD card");
        return false;
    #else
        // Try multiple SD card initialization methods if necessary
        int initAttempts = 0;
        const int maxAttempts = 3;
        
        #if defined(SD_MMC_D1)
            // First try 4-bit mode
            Serial.println("Attempting SD card in 4-bit mode...");
            SD_MMC.setPins(SD_MMC_CLK, SD_MMC_CMD, SD_MMC_D0, SD_MMC_D1, SD_MMC_D2, SD_MMC_D3);
            use1bitMode = false;
            
            // First attempt - 4-bit mode
            res = SD_MMC.begin("/sdcard", use1bitMode, formatIfMountFailed, sdmmcFreq);
            initAttempts++;
            
            if (!res) {
                // If 4-bit mode fails, fall back to 1-bit mode
                Serial.println("4-bit mode failed, falling back to 1-bit mode...");
                SD_MMC.end();
                delay(500);
                use1bitMode = true;
                SD_MMC.setPins(SD_MMC_CLK, SD_MMC_CMD, SD_MMC_D0);
            }
        #else
            // Only 1-bit mode available
            Serial.println("Configuring SD card in 1-bit mode");
            SD_MMC.setPins(SD_MMC_CLK, SD_MMC_CMD, SD_MMC_D0);
            use1bitMode = true;
        #endif
        
        // Try 1-bit mode if we haven't succeeded yet
        while (!res && initAttempts < maxAttempts) {
            // Try different frequency settings if we need to retry
            if (initAttempts > 0) {
                sdmmcFreq = 20000000; // Reduce frequency for reliability
                Serial.printf("Retry %d: SD card in 1-bit mode @ %d MHz\n", 
                              initAttempts, sdmmcFreq/1000000);
            }
            
            res = SD_MMC.begin("/sdcard", use1bitMode, formatIfMountFailed, sdmmcFreq);
            initAttempts++;
            
            if (!res) {
                // Short delay before retry
                delay(500);
            }
        }
    #endif
#else
    // Non-ESP32S3 boards
    res = SD_MMC.begin("/sdcard", use1bitMode, formatIfMountFailed, sdmmcFreq);
#endif

#if defined(CAMERA_MODEL_AI_THINKER)
    pinMode(4, OUTPUT);
    digitalWrite(4, 0); // set lamp pin fully off as sd_mmc library still initialises pin 4 in 1 line mode
#endif 

    if (res) {
        Serial.println("SD card mounted successfully");
        fp.mkdir(DATA_DIR);
        infoSD();
        
        // Test SD card with simple write/read operation
        File testFile = fp.open("/sdtest.txt", FILE_WRITE);
        if (testFile) {
            testFile.println("SD card test");
            testFile.close();
            Serial.println("SD write test successful");
            
            // Read test
            testFile = fp.open("/sdtest.txt", FILE_READ);
            if (testFile) {
                String testStr = testFile.readStringUntil('\n');
                testFile.close();
                fp.remove("/sdtest.txt");
                Serial.println("SD read test successful");
            } else {
                Serial.println("SD read test failed!");
                res = false;
            }
        } else {
            Serial.println("SD write test failed!");
            res = false;
        }
    } else {
        LOG_WRN("SD card mount failed");
        Serial.println("SD card mount failed"); 
    }
#endif
    return res;
}
     
static void listFolder(const char* rootDir) { 
  // list contents of folder
  LOG_INF("Sketch size %s", fmtSize(ESP.getSketchSize()));    
  File root = fp.open(rootDir);
  File file = root.openNextFile();
  while (file) {
    LOG_INF("File: %s, size: %s", file.path(), fmtSize(file.size()));
    file = root.openNextFile();
  }
  char totalBytes[20];
  strcpy(totalBytes, fmtSize(STORAGE.totalBytes()));
  LOG_INF("%s: %s used of %s", fsType, fmtSize(STORAGE.usedBytes()), totalBytes);
}

bool startStorage() {
  // start required storage device (SD card or flash file system)
  bool res = false;
#if (!CONFIG_IDF_TARGET_ESP32C3 && !CONFIG_IDF_TARGET_ESP32S2)
  if ((fs::SDMMCFS*)&STORAGE == &SD_MMC) {
    strcpy(fsType, "SD_MMC");
    res = prepSD_MMC();
    if (res) listFolder(DATA_DIR);
    else snprintf(startupFailure, SF_LEN, STARTUP_FAIL "Check SD card inserted");
    debugMemory("startStorage");
    return res; 
  }
#endif
  // One of SPIFFS or LittleFS
  if (!strlen(fsType)) {
#ifdef _SPIFFS_H_
    if ((fs::SPIFFSFS*)&STORAGE == &SPIFFS) {
      strcpy(fsType, "SPIFFS");
      res = SPIFFS.begin(formatIfMountFailed);
    }
#endif
#ifdef _LITTLEFS_H_
    if ((fs::LittleFSFS*)&STORAGE == &LittleFS) {
      strcpy(fsType, "LittleFS");
      res = LittleFS.begin(formatIfMountFailed);
      // create data folder if not present
      if (res) LittleFS.mkdir(DATA_DIR);
    }
#endif
    if (res) {  
      // list details of files on file system
      const char* rootDir = !strcmp(fsType, "LittleFS") ? DATA_DIR : "/";
      listFolder(rootDir);
    }
  } else {
    snprintf(startupFailure, SF_LEN, STARTUP_FAIL "Failed to mount %s", fsType);  
    dataFilesChecked = true; // disable setupAssist as no file system
  }
  debugMemory("startStorage");
  return res;
}

static void getOldestDir(char* oldestDir) {
  // get oldest folder by its date name
  File root = fp.open("/");
  File file = root.openNextFile();
  if (file) strcpy(oldestDir, file.path()); // initialise oldestDir
  while (file) {
    if (file.isDirectory() && strstr(file.name(), "System") == NULL // ignore Sys Vol Info
        && strstr(DATA_DIR, file.name()) == NULL) { // ignore data folder
      if (strcmp(oldestDir, file.path()) > 0) strcpy(oldestDir, file.path()); 
    }
    file = root.openNextFile();
  }
}

