kenyon-mitchell01/XIAO-ESP32S3-MJPEG2SD/src/EMJPEG2SD_DopamineChaser247_Version1/utilsFS.cpp
esp_err_t downloadFile(File& df, httpd_req_t* req) {
  // download file as attachment, required file name in inFileName
  // setup download header, create zip file if required, and download file
  esp_err_t res = ESP_OK;
  bool needZip = false;
  char downloadName[FILE_NAME_LEN];
  strcpy(downloadName, df.name());
  size_t downloadSize = df.size();
  char fsSavePath[FILE_NAME_LEN];
  strcpy(fsSavePath, inFileName);
#ifdef ISCAM
  changeExtension(fsSavePath, CSV_EXT);
  
  // check if ancillary files present
  needZip = STORAGE.exists(fsSavePath);
  const char* extensions[3] = {AVI_EXT, CSV_EXT, SRT_EXT};
  if (needZip) {
    // ancillary files, calculate total size for http header
    downloadSize = 0;
    for (const auto& ext : extensions) {
      changeExtension(fsSavePath, ext);
      File inFile = STORAGE.open(fsSavePath, FILE_READ);
      if (inFile) {
        // round up file size to 512 byte boundary and add header size
        downloadSize += (((inFile.size() + BLOCKSIZE - 1) / BLOCKSIZE) * BLOCKSIZE) + BLOCKSIZE;
        strcpy(downloadName, inFile.name());
        inFile.close();
      }
    }
    downloadSize += BLOCKSIZE * 2; // end of tarball marker
    changeExtension(downloadName, "zip"); 
  } 
#endif 

  // create http header
  LOG_INF("Download file: %s, size: %s", downloadName, fmtSize(downloadSize));
  httpd_resp_set_type(req, "application/octet-stream");
  // header field values must remain valid until first send
  char contentDisp[IN_FILE_NAME_LEN + 50];
  snprintf(contentDisp, sizeof(contentDisp) - 1, "attachment; filename=%s", downloadName);
  httpd_resp_set_hdr(req, "Content-Disposition", contentDisp);
  char contentLength[10];
  snprintf(contentLength, sizeof(contentLength) - 1, "%i", downloadSize);
  httpd_resp_set_hdr(req, "Content-Length", contentLength);

  if (needZip) {
#ifdef ISCAM
    // package avi file and ancillary files into uncompressed tarball
    for (const auto& ext : extensions) {
      changeExtension(fsSavePath, ext);
      File inFile = STORAGE.open(fsSavePath, FILE_READ);
      if (inFile) {
        res = writeHeader(inFile, req);
        if (res == ESP_OK) res = sendChunks(inFile, req, false);
        if (res == ESP_OK) {
          // write end of file filler
          size_t remainingBytes = inFile.size() % BLOCKSIZE;
          if (remainingBytes) {
            char zeroBlock[BLOCKSIZE - remainingBytes] = {};
            res = httpd_resp_send_chunk(req, zeroBlock, sizeof(zeroBlock));
          }
          inFile.close();
        }
      }
    }

    // Write two blocks filled with zeros to mark the end of the archive
    char zeroBlock[BLOCKSIZE] = {};
    res = httpd_resp_send_chunk(req, zeroBlock, BLOCKSIZE);
    res = httpd_resp_send_chunk(req, zeroBlock, BLOCKSIZE);
    res = httpd_resp_sendstr_chunk(req, NULL);
#endif
  } else res = sendChunks(df, req); // send AVI
  return res;
}

void uploadToComputer(const char* filepath) {
    if (WiFi.status() != WL_CONNECTED) {
        LOG_WRN("WiFi not connected");
        return;
    }

    HTTPClient http;
    http.begin("http://192.168.1.193:8000"); // ***Replace with your computer's IP***
    http.addHeader("Content-Type", "application/octet-stream");
    http.addHeader("X-Filename", filepath);

    File file = SD_MMC.open(filepath, FILE_READ); // Changed from SD to SD_MMC
    if (!file) {
        LOG_WRN("Failed to open file: %s", filepath);
        http.end();
        return;
    }

    // Get file size
    size_t fileSize = file.size();
    if (fileSize == 0) {
        LOG_WRN("File is empty: %s", filepath);
        file.close();
        http.end();
        return;
    }

    // Allocate buffer for the file (use PSRAM if available)
    uint8_t* buffer = (uint8_t*)ps_malloc(fileSize);
    if (!buffer) {
        LOG_WRN("Failed to allocate buffer for file: %s", filepath);
        file.close();
        http.end();
        return;
    }

    // Read the file into the buffer
    size_t bytesRead = file.read(buffer, fileSize);
    file.close();

    if (bytesRead != fileSize) {
        LOG_WRN("Failed to read entire file: %s, read %u of %u bytes", filepath, bytesRead, fileSize);
        free(buffer);
        http.end();
        return;
    }

    // Send the file
    int httpCode = http.POST(buffer, fileSize);
    if (httpCode == HTTP_CODE_OK) {
        LOG_INF("Uploaded: %s", filepath);
    } else {
        LOG_WRN("Upload failed, code: %d", httpCode);
    }

    free(buffer);
    http.end();
}

void uploadRecordings() {
    // Check WiFi connection first
    if (WiFi.status() != WL_CONNECTED) {
        LOG_WRN("WiFi not connected, cannot upload files");
        return;
    }
    
    Serial.println("Starting file upload process...");
    
    // Find the latest recording folder (today's folder)
    char todayFolder[FILE_NAME_LEN];
    dateFormat(todayFolder, sizeof(todayFolder), true);
    
    File root = SD_MMC.open(todayFolder);
    if (!root) {
        LOG_WRN("Failed to open today's folder: %s", todayFolder);
        return;
    }
    
    if (!root.isDirectory()) {
        LOG_WRN("%s is not a directory", todayFolder);
        root.close();
        return;
    }
    
    // Count files to upload
    int fileCount = 0;
    File file = root.openNextFile();
    while (file) {
        if (!file.isDirectory() && strstr(file.name(), AVI_EXT)) {
            fileCount++;
        }
        file.close();
        file = root.openNextFile();
    }
    
    // Reset directory reading
    root.close();
    root = SD_MMC.open(todayFolder);
    
    if (fileCount == 0) {
        LOG_INF("No files to upload in %s", todayFolder);
        root.close();
        return;
    }
    
    LOG_INF("Found %d files to upload in %s", fileCount, todayFolder);
    
    // Upload each file
    int uploadedCount = 0;
    file = root.openNextFile();
    while (file) {
        if (!file.isDirectory() && strstr(file.name(), AVI_EXT)) {
            char filepath[FILE_NAME_LEN];
            snprintf(filepath, FILE_NAME_LEN, "%s/%s", todayFolder, file.name());
            
            // Get file size
            size_t fileSize = file.size();
            if (fileSize > 0) {
                LOG_INF("Uploading file: %s (%s)", filepath, fmtSize(fileSize));
                
                HTTPClient http;
                
